/*
   关于java语言中的标识符
   1、什么是标识符？
   -在java源程序中凡是程序员有权利命名的单词都是标识符
   -标识符可以标识的元素包括：类名；方法名；变量名；接口名；常量名···
   2、标识符的命名规则？【相当于语法，不遵守会报错】
   -必须由数字、字母、下划线、＄组成，不能含有其他符号
   -不能以数字开头
   -严格区分大小写
   -关键字不能做标识符
   -理论上无长度限制
   3、标识符的命名规范【仅仅是规范，不属于语法，不遵守也不会报错】
   -最好见名知义
   -遵守驼峰命名方式，即单词首字母大写。
   -类名、接口名、首字母大写，后面每个单词首字母大写。
   -变量名、方法名：首字母小写，后面每个单词首字母大写
   -常量名：全部大写
*/

public class IdentifierTest01 //IdentifierTest01是一个类名
{
    public static void main(String[] args) {
        
    }
}
